"""
Task 1: Реалізуйте генераторну функцію, яка повертатиме по одному члену числової послідовності,
закон якої задається за допомогою функції користувача. Крім цього параметром генераторної
функції повинні бути значення першого члена прогресії та кількість членів, що видаються послідовностю.
Генератор повинен зупинити свою роботу або по досягненню n-го члена, або при передачі команди на завершення.
"""

def func(item):
    return item ** 3
def gen_func(start, count, func):
    index = 0
    while index < count:
        yield func(start)
        start += 1
        index += 1


for i in gen_func(2, 5, func):
    print(f'Seq element: {i}')

